---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures
source: html/2e33b696-0ec1-46b3-8f58-099dfb431f60.htm
---
# BuiltInFailures.GeometryFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.